server/performance/weekly-prediction-test.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 20
      arrivalRate: 1
      name: Warm up
    - duration: 30
      arrivalRate: 5
      name: Load test
    - duration: 20
      arrivalRate: 10
      name: Stress test
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Weekly Prediction Performance Test"
    flow:
      - post:
          url: "/api/auth/register"
          json:
            firstName: "Prediction"
            lastName: "Tester"
            email: "pred-test-{{ $randomString(8) }}@example.com"
            password: "password123"
            confirmPassword: "password123"
            phoneNumber: "1234567890"
          capture:
            - json: "$.user.email"
              as: "userEmail"
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ userEmail }}"
            password: "password123"
          capture:
            - json: "$.token"
              as: "authToken"
      - post:
          url: "/api/progress"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            weekStartDate: "2024-01-01T00:00:00.000Z"
            weight: 80.0
          capture:
            - json: "$._id"
              as: "progressId"
      - get:
          url: "/api/progress/history"
          headers:
            Authorization: "Bearer {{ authToken }}"
      - post:
          url: "/api/progress"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            weekStartDate: "2024-01-08T00:00:00.000Z"
            weight: 79.0
      - post:
          url: "/api/progress"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            weekStartDate: "2024-01-15T00:00:00.000Z"
            weight: 78.0
      - get:
          url: "/api/progress/history"
          headers:
            Authorization: "Bearer {{ authToken }}"